In [2]:
import pandas as pd
import numpy as np

### Series

In [3]:
s = pd.Series(np.random.randn(4), name="daily returns")
print(s)

0    0.432444
1    0.777825
2   -0.245248
3    0.375754
Name: daily returns, dtype: float64

In [4]:
s * 100

0    43.244407
1    77.782500
2   -24.524805
3    37.575421
Name: daily returns, dtype: float64

In [5]:
np.abs(s)

0    0.432444
1    0.777825
2    0.245248
3    0.375754
Name: daily returns, dtype: float64

In [6]:
s.describe()

count    4.000000
mean     0.335194
std      0.425808
min     -0.245248
25%      0.220504
50%      0.404099
75%      0.518789
max      0.777825
Name: daily returns, dtype: float64

In [7]:
s.index = ["Mert", "Didem", "Berk", "Mustafa"]
print(s)

Mert       0.432444
Didem      0.777825
Berk      -0.245248
Mustafa    0.375754
Name: daily returns, dtype: float64

### DataFrames

In [9]:
df = pd.read_csv('dataset/asd.csv')

In [10]:
df

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
0,Argentina,ARG,2000,37335.653,0.999500,2.950722e+05,75.716805,5.578804
1,Australia,AUS,2000,19053.186,1.724830,5.418047e+05,67.759026,6.720098
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954
5,South Africa,ZAF,2000,45064.098,6.939830,2.272424e+05,72.718710,5.726546
6,United States,USA,2000,282171.957,1.000000,9.898700e+06,72.347054,6.032454
7,Uruguay,URY,2000,3219.793,12.099592,2.525596e+04,78.978740,5.108068

In [15]:
df[2:5]

,country,country isocode,year,POP,XRAT,tcgdp,cc,cg
2,India,IND,2000,1006300.297,44.941600,1.728144e+06,64.575551,14.072206
3,Israel,ISR,2000,6114.570,4.077330,1.292539e+05,64.436451,10.266688
4,Malawi,MWI,2000,11801.505,59.543808,5.026222e+03,74.707624,11.658954

In [18]:
df[["country", "tcgdp"]]

         country         tcgdp
0      Argentina  2.950722e+05
1      Australia  5.418047e+05
2          India  1.728144e+06
3         Israel  1.292539e+05
4         Malawi  5.026222e+03
5   South Africa  2.272424e+05
6  United States  9.898700e+06
7        Uruguay  2.525596e+04

In [20]:
df.iloc[2:5,0:4]

  country country isocode  year          POP
2   India             IND  2000  1006300.297
3  Israel             ISR  2000     6114.570
4  Malawi             MWI  2000    11801.505

In [24]:
df.loc[2:5, ["country"]]

        country
2         India
3        Israel
4        Malawi
5  South Africa